# Alexis
##### https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html

In [8]:
import pandas as pd
import sys
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
# from pandas.tools.plotting import radviz

%matplotlib inline

In [10]:
mi_df = pd.DataFrame(({'a': [11,12,13], 'b': [21,22,23],'c': [54,55,56]}))
print (mi_df)

    a   b   c
0  11  21  54
1  12  22  55
2  13  23  56

In [11]:
data = {'ciudad': ['Loja', 'Pichincha', 'Guayas'],
        'capital' : ['Loja', 'Quito', 'Guayaquil'],
        'zona'  : [7, 8, 1],
       '#cantones' : [16,8,25]}
frame = pd.DataFrame(data) # Creando un DataFrame desde un diccionario
frame

      ciudad    capital  zona  #cantones
0       Loja       Loja     7         16
1  Pichincha      Quito     8          8
2     Guayas  Guayaquil     1         25

In [12]:
columnas = ['nombres','apellidos','cedula','ciudad']

In [13]:
lista = [['rene', 'elizalde', '11041260','Quito'],
        ['rolando', 'solano', '11041261','Quito2'],
        ['Alexis','Montoya','110567','Loja'],
         ['Luis','Jaramillo','11000','España'],
        ['Marco','Briceño','121212','Carimanga'],]

In [14]:
data = pd.DataFrame(lista, columns=columnas)

In [15]:
data

   nombres  apellidos    cedula     ciudad
0     rene   elizalde  11041260      Quito
1  rolando     solano  11041261     Quito2
2   Alexis    Montoya    110567       Loja
3     Luis  Jaramillo     11000     España
4    Marco    Briceño    121212  Carimanga

In [17]:
lista2 = [['rene2', 'elizalde2', '11041263','Quito'],
        ['rolando2', 'solano2', '11041264','Quito2'],]

In [18]:
data2 = pd.DataFrame(lista2, columns=columnas)

In [19]:
data2

    nombres  apellidos    cedula  ciudad
0     rene2  elizalde2  11041263   Quito
1  rolando2    solano2  11041264  Quito2

In [20]:
data3 = pd.concat([data, data2])

In [21]:
data3

    nombres  apellidos    cedula     ciudad
0      rene   elizalde  11041260      Quito
1   rolando     solano  11041261     Quito2
2    Alexis    Montoya    110567       Loja
3      Luis  Jaramillo     11000     España
4     Marco    Briceño    121212  Carimanga
0     rene2  elizalde2  11041263      Quito
1  rolando2    solano2  11041264     Quito2

In [32]:
data5 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263', '11041266'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito', 'Loja'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha', 'Loja']})

In [33]:
data5

     cedula     Ciudad  Provincia
0  11041260  Guayaquil     Guayas
1  11041261     Cuenca      Azuay
2  11041263      Quito  Pichincha
3  11041266       Loja       Loja

In [34]:
result = pd.merge(data3, data5, on='cedula')

In [35]:
result

   nombres  apellidos    cedula     Ciudad  Provincia
0     rene   elizalde  11041260  Guayaquil     Guayas
1  rolando     solano  11041261     Cuenca      Azuay
2    rene2  elizalde2  11041263      Quito  Pichincha

In [36]:
data6 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha']})
data6

     cedula     Ciudad  Provincia
0  11041260  Guayaquil     Guayas
1  11041261     Cuenca      Azuay
2  11041263      Quito  Pichincha